export default class News {

    constructor(options) {
        
        this.data = {
            
            20200414 : "В Москве оформили 3,2 млн цифровых пропусков. 55 нарушителей карантина оштрафованы",
            20200413 : "Введен пропускной режим для передвижения по городу на личном или общественном транспорте",
            20200412 : "Составлено 1 358 протоколов за нарушение социальной дистанции",
            20200411 : "Ракова: столичные больницы и скорая работают на пределе",
            20200410 : "По данным геоаналитики сотовых операторов, 10 апреля в Москве 3,5 млн. человек покидали дом на продолжительное время",
            20200409 : "В Москве создан комитет по борьбе с коронавирусом. Столичные кладбища закроют для посещений из-за коронавируса",
            20200407 : "Более 7 тысяч онлайн-консультаций провели врачи для больных коронавирусом",
            20200406 : "Почти 85% заболевших младше 65 лет ",
            20200405 : "Москва технически готова к запуску умной системы контроля самоизоляции в случае необходимости",
            20200404 : "Вступили в силу поправки в КоАП, устанавливающие ответственность за нарушение режима повышенной готовности",
            20200403 : "90% людей старше 65 лет соблюдают режим самоизоляции",
            20200402 : "Президент Владимир Путин подписал указ о продлении нерабочих дней до 1 мая",
            20200401 : "Шереметьево временно закрывает международный терминал D",
            20200331 : "Более 10 тысяч человек обратились в службу занятости за выплатами для безработных",
            20200330 : "Большинство новых заболевших - молодые люди от 18 до 40 лет",
            20200329 : "Первый день нерабочей недели. Почти 40% пациентов на ИВЛ в Москве моложе 40 лет",
            20200328 : "Временно приостанавливается проведение любых культурных, развлекательных и других досуговых мероприятий",
            20200327 : "Около 100 человек в Москве проходят лечение от коронавируса на дому",
            20200326 : "Вводится обязательный домашний карантин для жителей старше 65 лет, а также для москвичей с хроническими заболеваниями",
            20200325 : "Президент объявил о предстоящей нерабочей неделе и призвал всех побыть дома",
            20200323 : "Отменяется льготный проезд в общественном транспорте для школьников",
            20200320 : "Шереметьево приостановило работу международных терминалов E и С",
            20200318 : "Сергей Собянин попросил столичные компании перевести сотрудников на удаленную работу",
            20200317 : "В СМИ распространялась информация, якобы Москву закроют на карантин",
            20200316 : "Запрещается проведение любых досуговых мероприятий с участием более 50 человек",
            20200315 : "Из больницы в Коммунарке выписаны 52 человека, у них не подтвердился коронавирус",
            20200314 : "Вводится свободное посещение школ. Школы продолжают работать",
            20200313 : "В московские больницы временно прекращён доступ посетителей к пациентам",
            20200310 : "Определена площадка для строительства новой инфекционной больницы в новой Москве",
            20200307 : "Выписан первый в Москве выздоровевший пациент",
            20200306 : "Все заболевшие вернулись в Москву из Италии",
            20200305 : "Сергей Собянин поручил проработать проект быстровозводимого больничного корпуса для пациентов, у которых выявлен вирус COVID-19",
            20200304 : "Все прибывающие из Китая, Южной Кореи и Ирана получают постановление об обязательной изоляции на дому",
            20200303 : "В Коммунарке оборудован новый больничный комплекс для пациентов с подозрением на коронавирус",
            20200302 : "Первый заболевший москвич находится в инфекционной больнице и получает необходимое лечение"
    
        }
        
        
        
        return this;
    }
    
}