const fs = require(`fs`)

const points = {
  'Балашиха': [55.796339, 37.938199],
  'Богородский': [55.890320, 38.438767],
  'Бронницы': [55.425399, 38.264027],
  'Власиха': [55.685503, 37.190423],
  'Волоколамск': [56.035728, 35.958537],
  'Воскресенск': [55.322978, 38.673353],
  'Дзержинский': [55.630939, 37.849616],
  'Дмитров': [56.344052, 37.520294],
  'Долгопрудный': [55.933564, 37.514104],
  'Домодедово': [55.437168, 37.767995],
  'Дубна': [56.744002, 37.173140],
  'Егорьевск': [55.383050, 39.035833],
  'Жуковский': [55.597475, 38.119802],
  'Зарайск': [54.756973, 38.874845],
  'Звездный городок': [55.877183, 38.109193],
  'Ивантеевка': [55.971718, 37.924338],
  'Истра': [55.914287, 36.860284],
  'Кашира': [54.834589, 38.151540],
  'Клин': [56.331693, 36.728716],
  'Коломна': [55.103152, 38.752917],
  'Королев': [55.922212, 37.854629],
  'Котельники': [55.659840, 37.863199],
  'Красноармейск': [56.120959, 38.140940],
  'Красногорск': [55.831099, 37.330192],
  'Краснознаменск': [55.600506, 37.042489],
  'Ленинский': [55.547657, 37.771571],
  'Лобня': [56.012269, 37.474821],
  'Лосино-Петровский': [55.872183, 38.200983],
  'Лотошино': [56.227310, 35.639419],
  'Луховицы': [54.965217, 39.025394],
  'Лыткарино': [55.579297, 37.908986],
  'Люберцы': [55.676494, 37.898116],
  'Можайск': [55.506714, 36.017358],
  'Мытищи': [55.910483, 37.736402],
  'Наро-Фоминск': [55.384170, 36.723201],
  'Озеры': [54.854087, 38.559824],
  'Одинцово': [55.678859, 37.263986],
  'Орехово-Зуево': [55.805837, 38.981592],
  'Павловский Посад': [55.779393, 38.651318],
  'Подольск': [55.431177, 37.544737],
  'Протвино': [54.864969, 37.215100],
  'Пушкино': [56.011182, 37.847047],
  'Раменское': [55.567326, 38.225840],
  'Реутов': [55.760515, 37.855141],
  'Рошаль': [55.663283, 39.862759],
  'Руза': [55.703657, 36.192233],
  'Сергиев Посад': [56.315311, 38.135963],
  'Серебряные Пруды': [54.473926, 38.724988],
  'Серпухов': [54.913536, 37.416763],
  'Солнечногорск': [56.185102, 36.977631],
  'Ступино': [54.886274, 38.078228],
  'Талдом': [56.730919, 37.527938],
  'Фрязино': [55.957938, 38.052339],
  'Химки': [55.888740, 37.430390],
  'Чехов': [55.149851, 37.466997],
  'Шатура': [55.577577, 39.544566],
  'Шаховская': [56.031166, 35.510394],
  'Щелково': [55.920875, 37.991622],
  'Электрогорск': [55.883161, 38.786209],
  'Электросталь': [55.784445, 38.444849],
  'Ногинск': [55.854522, 38.441831],
  'Наро-Фоминск': [55.384170, 36.723201],
  'Видное (Ленинский)': [55.556869, 37.708778],
  'Черноголовка' : [56.009995, 38.379245],
  'Пущино' : [54.830519, 37.633634]    
}

fs.readFile('./data/oblast.txt', 'utf8', function(err, contents) {
    
    const result = convert(contents);
    
    fs.writeFileSync(`./data/oblast.json`, JSON.stringify(result), `utf-8`);
    
});

function convert(contents) {
    
    const strings = contents.split('\n\n');
    
    let obj = {},
        tick = -1, 
        date = null;
    
    for (var i = 0; i < strings.length; i++) {
        
        if ( strings[i].includes('--') ) {
            
            date = strings[i].replace('--','').split('.');
            tick++;
            
        } else {
            
            let parts = strings[i].split(' - '),
                name = parts[0],
                value = new Number( parts[1] ) + 0,
                _date = date[0]+date[1]+date[2];
            
            
            
            if (name.length > 1) { 
                
                if (!obj[_date]) obj[_date] = {};
                
                //console.log(name)
                
                obj[_date][name] = {
                    name : name,
                    total : value,
                    point : [
                        new Number(points[name][0].toFixed(3)) + 0,
                        new Number(points[name][1].toFixed(3)) + 0
                    ]
                }
                
            } 

        }
        
    }
    
    
    
    //add prev
    let lastkey = null;
    
    for (var d in obj) {
        
        if (lastkey) {
            
            for (var p in obj[lastkey]) {
                
                if ( !obj[d][p] ) {
                    
                    //console.log(p)
                    obj[d][p] = obj[lastkey][p];
                    
                }
                
            }
            
        }
        
        lastkey = d;
        
    }
    
    //obj to arr
    for (var d in obj) {
        let tempArr = [];
        for (var p in obj[d]) {
            
            tempArr.push(obj[d][p])
            
        }
        
        obj[d] = tempArr;
        
    }
    
    
    console.log('/oblast.json build')
    
    return obj;
    
}